{
	"name": "Fabio Miranda",
	"image": "images/fabio-miranda-2-cropped.jpg",
	"bio": ["I am an Assistant Professor at the Department of Computer Science at the University of Illinois Chicago. I am interested in developing techniques that allow for the interactive analysis of large-scale data, combining methods from visualization, GIS, data management, machine learning, and computer graphics. In particular, I focus on how urban visual analytics can help address different problems cities face by integrating data on different resolutions and from different sources. Some of the urban topics I am interested in include transportation, mobility, climate, air and noise pollution. I am a regular program committee member of various visualization and visual analytics flagship venues.",
	"I have worked closely with domain experts from different fields, such as architects, urban planners, climate scientists, occupational therapists, transportation specialists, signal processing, and acoustics researchers. The outcome of these collaborations included not only research published in leading venues, but also systems that were made available to experts in academia, industry and government agencies. My work has also received extensive coverage from different media outlets, including The New York Times, The Economist, Univision, Architectural Digest, Curbed, Flowing Data, among others.",
	"My research has been funded by NSF, NIH, DOT, and DPI, and has received several awards, including the SIGMOD Best Demo and IEEE VIS Best Paper Honorable Mention awards."],
	"contact": {
		"UIC": "https://cs.uic.edu/profiles/miranda-fabio/",
		"linkedin": "http://www.linkedin.com/in/fabiomarkusmiranda",
		"google scholar": "https://scholar.google.com/citations?user=9fR0LqAAAAAJ&hl=en",
		"researchgate": "https://www.researchgate.net/profile/Fabio_Miranda13",
		"dblp": "https://dblp.uni-trier.de/pers/hd/m/Miranda_0001:Fabio",
        "twitter": "https://twitter.com/fabiom_miranda",
        "The Urban Toolkit": "https://urbantk.org/"
	}
}
